In [14]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /Users/snoorsalihi/opt/anaconda3/lib/python3.9/site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in /Users/snoorsalihi/opt/anaconda3/lib/python3.9/site-packages (from openpyxl) (1.1.0)

In [2]:
import pandas as pd

In [28]:
df = pd.read_csv('cities.csv')
df.head()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI

In [ ]:
new_column = {'weight': 'unknown values'}

jsonf = jsonf.append(new_column, ignore_index=True)
jsonf.tail()

In [ ]:
np.NaN

In [ ]:
df["zip_code"] = ""
df

In [ ]:
csvf = csvf.assign(CountryCode='Unknown')

In [ ]:
# Create a dataframe

dict = {"Mathematics":[95, 90, 99],
        "Science": [99, 95, 92]}
 
df1 = pd.DataFrame(dict, index=["Aiyana", "Anisha", "Saanvi"])
#
# Create another dataframe
#
df2 = pd.DataFrame({"Mathematics": [96],
                    "Science": [99]},
                   index=["Snehal"])
#
# Concat dataframes
#
pd.concat([df1, df2])

In [10]:

# Adding a new column using loc method

df.loc[:, ["zipcode"]] = [1, 2, 3, 4,]

ValueError: cannot set using a multi-index selection indexer with a different length than the value

In [ ]:
# Adding a new column using brackets
#
df["Hindi"] = [81, 79, 72, 76]

In [ ]:

# Adding a column at a specified position using insert method

df.insert(1, "Social Science", [86, 78, 82, 80])

In [20]:

df2=pd.read_excel('CarSalesByModelStart-3.xlsx', engine = 'openpyxl')
df2.head()

,Year,Month,Date,Model,Dealer ID,Quantity Sold,Profit
0,2018,January,2018-01-01 23:00:00,Beaufort,1222,10,15000.0
1,2018,January,2018-01-01 23:00:00,Salish,1222,13,39650.0
2,2018,January,2018-01-01 23:00:00,Labrador,1222,16,12800.0
3,2018,January,2018-01-01 23:00:00,Champlain,1222,3,6900.0
4,2018,January,2018-01-01 23:00:00,Hudson,1222,22,11000.0

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1200 entries, 0 to 1199
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Year           1200 non-null   int64
 1   Month          1200 non-null   object
 2   Date           1200 non-null   datetime64[ns]
 3   Model          1200 non-null   object
 4   Dealer ID      1200 non-null   int64
 5   Quantity Sold  1200 non-null   int64
 6   Profit         1200 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(3), object(2)
memory usage: 65.8+ KB

In [17]:
df2.describe()

              Year    Dealer ID  Quantity Sold        Profit
count  1200.000000  1200.000000     1200.00000   1200.000000
mean   2018.500000  1281.800000       17.99750  24974.055208
std       0.500208    72.453672        9.97432  17370.750612
min    2018.000000  1212.000000        2.00000   4600.000000
25%    2018.000000  1217.000000       11.00000  13500.000000
50%    2018.500000  1256.000000       18.00000  18500.000000
75%    2019.000000  1336.000000       24.00000  28922.812500
max    2019.000000  1402.000000       48.00000  83875.000000

Consider the following dataframe and do as directed:
import pandas as pd
d={‘Mouse’:[150,200,300,400],
   ‘Keyboard’:[180,200,190,300],
   ‘Scanner’:[200,280,330,450]}
df=pd.DataFrame(d.index=[‘Jan’,’Feb’,’March’,’April’])

Write code to access data of Mouse and Scanner columns.
Write code to access data of the Keyboard column using dot notation and column name.
Write code to access data of scanners using loc[].
Write code to access data of all columns where mouse data is more than 200.
Write code to access columns using 0 and 2.
Write code to access data of rows of jan and march for scanner and keyboard

In [34]:
#Consider the following dataframe and do as directed:
import pandas as pd
d={'Mouse':[150,200,300,400],
   'Keyboard':[180,200,190,300],
   'Scanner':[200,280,330,450]}
df=pd.DataFrame(d,index=['Jan','Feb','March','April'])
df

       Mouse  Keyboard  Scanner
Jan      150       180      200
Feb      200       200      280
March    300       190      330
April    400       300      450

In [39]:
#Write code to access data of Mouse and Scanner columns.
df.loc[:,['Mouse', 'Scanner']]

       Mouse  Scanner
Jan      150      200
Feb      200      280
March    300      330
April    400      450

In [49]:
#Write code to access data of the Keyboard column using dot notation and column name.
df.loc[:,['Keyboard']]

       Keyboard
Jan         180
Feb         200
March       190
April       300

In [50]:
#Write code to access data of scanners using loc[].
df.loc[:,['Scanner']]

       Scanner
Jan        200
Feb        280
March      330
April      450

In [53]:
#Write code to access data of all columns where mouse data is more than 200.
df[df['Mouse']>200]

       Mouse  Keyboard  Scanner
March    300       190      330
April    400       300      450

In [58]:
#Write code to access columns using 0 and 2.
df.iloc[:,0:2]

       Mouse  Keyboard
Jan      150       180
Feb      200       200
March    300       190
April    400       300

In [60]:
#Write code to access data of rows of jan and march for scanner and keyboard
df.loc[['Jan','March'],['Scanner', 'Keyboard']]

       Scanner  Keyboard
Jan        200       180
March      330       190